{
    "id": 16864,
    "listingKeyNumeric": "88807571",
    "fullAddress": "260064 Bearspaw, Rural Rocky View County, Alberta, T3R 1H4",
    "isDiamondType": true,
    "propertyType": "Residential",
    "city": "Rural Rocky View County",
    "stateOrProvince": "Alberta",
    "listPrice": 1299900,
    "listPriceSquareFoot": 623.7524,
    "imagesUrl": [
        "https://myproagents.com/storage/88782641/photo-88782641-1.jpeg",
        "https://myproagents.com/storage/88782641/photo-88782641-1.jpeg",
        "https://myproagents.com/storage/88782641/photo-88782641-1.jpeg",
        "https://myproagents.com/storage/88782641/photo-88782641-1.jpeg",
        "https://myproagents.com/storage/88782641/photo-88782641-1.jpeg",
        "https://myproagents.com/storage/88782641/photo-88782641-1.jpeg",
        "https://myproagents.com/storage/88782641/photo-88782641-1.jpeg",
        "https://myproagents.com/storage/88782641/photo-88782641-1.jpeg"
    ],
    "primaryImage": "https://myproagents.com/storage/88782641/photo-88782641-1.jpeg",
    "listingId": "A2113083",
    "bedrooms": "4",
    "bathrooms": "4",
    "garage": "2",
    "garageSpaces": "2",
    "isGarage": "1",
    "livingAreaSF": "2084.00",
    "yearBuilt": "1997",
    "publicRemarks": "Situated on a sprawling 4.5-acre lot with panoramic views and impeccable landscaping, this lovely abode offers a harmonious blend of comfort and charm. As you step through the front door, you're greeted by an ambiance of warmth and openness. The kitchen is adorned with stainless steel appliances and a captivating tile backsplash, combining style and functionality. Natural light pours in through the window above the sink, illuminating the space and highlighting the sleek finishes. A pantry provides ample storage space. For casual dining, the eating nook provides a bright and cheerful space, offering panoramic views of the backyard. With easy access to the deck, it's the ideal spot for enjoying morning coffee. Adjacent to the kitchen, the family room beckons with its cozy ambiance. A fireplace, adorned with a tile surround, serves as the focal point, offering warmth and comfort on chilly evenings. A large window floods the room with natural light, creating a serene atmosphere for relaxation and unwinding after a long day. Seamlessly flowing into the dining room, which boasts large windows that bathe the area in sunlight, this space becomes the perfect setting for entertaining guests or enjoying family meals. The living room, open to the dining room, boasts a window overlooking the front porch providing a picturesque view of the outdoors. Completing this welcoming level is the main floor laundry and a 2pc powder room. Retreat to the primary bedroom, where luxury meets comfort. Complete with a 4-piece ensuite and a spacious walk-in closet. Three additional great sized bedrooms and a 4pc bathroom top of this upper floor.  Descend to the basement, where endless possibilities await. A large recreation room and family room space offer ample opportunity for relaxation and entertainment. Whether you envision a home gym, a play area for the kids, or a cozy retreat for movie nights, the basement provides the canvas to bring your vision to life. Additionally, a generously sized office that can be easily transformed into a bedroom presents the perfect space for work or study. A 3pc bathroom completes this fantastic space. This remarkable home offers the perfect blend of comfort and functionality, providing a serene retreat just minutes away to all amenities. With its exquisite features and tranquil surroundings pride of ownership is seen throughout.   ",
    "latitude": "50.000000",
    "longitude": "-85.000000",
    "streetNumber": "260064",
    "streetName": "Bearspaw",
    "streetSuffix": "Road",
    "streetDirSuffix": null,
    "postalCode": "T3R 1H4",
    "transactionType": "For Sale",
    "flooring": "Carpet,Tile",
    "constructionMaterials": "Stucco",
    "parkingFeatures": "Double Garage Attached",
    "zoning": "RUR",
    "fireplaceFeatures": "Gas",
    "accessibilityFeatures": null,
    "communityFeatures": "Schools Nearby,Shopping Nearby",
    "exteriorFeatures": "Private Yard",
    "interiorFeatures": "Closet Organizers,Open Floorplan,Pantry,Walk-In Closet(s)",
    "laundryFeatures": "Main Level",
    "lotFeatures": "Back Yard,Few Trees,Front Yard",
    "patioAndPorchFeatures": "Deck,Front Porch",
    "urlAlternateFeatureSheet": null,
    "waterfrontFeatures": null,
    "fencing": "Partial",
    "sewer": "Septic Field,Septic Tank",
    "frontageLength": "0.00M 0`0\"",
    "created_Date": null,
    "modified_Date": "2024-03-11T08:20:04.36"
}